luckyCharm1123/STM32_LED/Core/Src/main.c
    // 重置接收状态，为下一次接收做准备
    rx_index = 0;              // 重置索引
    rx_complete = 0;           // 清除完成标志
    memset(rx_buffer, 0, RX_BUFFER_SIZE);  // 清空接收缓冲区
    
    // 重新启动串口接收中断，准备接收下一个命令
    HAL_UART_Receive_IT(&huart2, &rx_buffer[rx_index], 1);
  }
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point. 应用程序入口点
  * @details 这是C程序的主函数，程序从这里开始执行
  *          执行流程：
  *          1. 硬件初始化（HAL库初始化）
  *          2. 系统时钟配置
  *          3. 外设初始化（GPIO、USART2）
  *          4. 发送启动信息
  *          5. 进入主循环，处理串口数据和LED闪烁
  * @retval int 返回值
  *         - 0: 程序正常退出（理论上不会执行到这里）
  *         - 其他值: 错误代码
  */
int main(void)
{
  /* USER CODE BEGIN 1 */
  /* 用户代码开始：第1区 */
  /* 可以在此处添加主函数开始前的预处理代码 */
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/
  /* MCU配置 */

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  /* 复位所有外设，初始化Flash接口和Systick定时器
   * HAL_Init()函数执行以下操作：
   * - 复位所有外设寄存器到默认值
   * - 初始化Flash接口（设置等待周期等）
   * - 配置SysTick定时器（1ms中断）
   * - 设置NVIC优先级分组
   */
  HAL_Init();

  /* USER CODE BEGIN Init */
  /* 用户代码开始：初始化 */
  /* 可以在此处添加自定义的初始化代码 */
  /* USER CODE END Init */

  /* Configure the system clock */
  /* 配置系统时钟 */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */
  /* 用户代码开始：系统初始化 */
  /* 可以在此处添加系统级初始化代码 */
  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  /* 初始化所有配置的外设 */
  MX_GPIO_Init();              // 初始化GPIO（LED引脚）
  MX_ADC1_Init();              // 初始化ADC1（雨水传感器，PA0）
  MX_USART1_UART_Init();       // 初始化USART1（调试串口）
  MX_USART2_UART_Init();       // 初始化USART2（串口）
  
  /* 用户代码开始：第2区 */
  /* 设置为ESP模式，避免触发用户命令处理逻辑 */
  esp_mode = 1;
  
  /* 信息缓冲区 */
  char info_buffer[100];
  
  /* 发送调试信息到USART1（调试串口） */
  DEBUG_SendString("\r\n=== STM32F103 Debug Port (USART1) ===\r\n");
  DEBUG_SendString("Port: PA9(TX) / PA10(RX)\r\n");
  DEBUG_SendString("Baud: 115200 8N1\r\n");
  DEBUG_SendString("System starting...\r\n\r\n");
  
  /* 初始化SHT30温湿度传感器（软件I2C版本） */
  DEBUG_SendString("=== SHT30 Sensor Initialization (Software I2C) ===\r\n");
  DEBUG_SendString("Using GPIO simulation I2C - No pull-up resistors needed!\r\n");
  DEBUG_SendString("Pins: PB6=SCL, PB7=SDA\r\n");
  DEBUG_SendString("I2C Address: 0x88 (0x44<<1, write mode)\r\n\r\n");
  
  SHT30_Soft_Init();  // 初始化软件I2C
  HAL_Delay(200);
  
  DEBUG_SendString("Testing I2C communication...\r\n");
  SHT30_Soft_Test();  // 测试I2C通信
  
  DEBUG_SendString("\r\nReading sensor data...\r\n");
  float test_temp, test_humi;
  uint8_t read_result = SHT30_Soft_Read(&test_temp, &test_humi);
  
  /* 转换为整数输出 */
  int temp_int = (int)test_temp;
  int temp_dec = (int)((test_temp - temp_int) * 100);
  int humi_int = (int)test_humi;
  int humi_dec = (int)((test_humi - humi_int) * 100);
  
  if(read_result == 0)
  {
    snprintf(info_buffer, sizeof(info_buffer), "[OK] SHT30 initialized! Temp: %d.%02d°C, Humi: %d.%02d%%\r\n", 
             temp_int, temp_dec, humi_int, humi_dec);
    DEBUG_SendString(info_buffer);
    USART2_SendString("[INFO] SHT30 sensor ready\r\n");
  }
  else
  {
    snprintf(info_buffer, sizeof(info_buffer), "[WARN] CRC failed, but got data: Temp: %d.%02d°C, Humi: %d.%02d%%\r\n", 
             temp_int, temp_dec, humi_int, humi_dec);
    DEBUG_SendString(info_buffer);
    USART2_SendString("[WARN] SHT30 CRC error\r\n");
  }
  
  DEBUG_SendString("=== SHT30 Initialization Complete ===\r\n\r\n");
  
  /* 启动串口接收中断，用于接收ESP模块的响应 */
  HAL_UART_Receive_IT(&huart2, &rx_buffer[0], 1);
  
  /* 检查ESP WiFi自动连接状态 */
  if(ESP_CheckAutoConnect() == ESP_OK)
  {
    /* WiFi已连接，获取IP地址 */
    ESP_Status_t* status = ESP_GetStatus();
    if(strlen(status->ip_address) > 0)
    {
      USART2_SendString("WiFi connected. IP: ");
      USART2_SendString(status->ip_address);
      USART2_SendString("\r\n");
    }
    else
    {
      /* 自动连接成功但没有IP地址，手动查询 */
      USART2_SendString("WiFi connected but no IP found, querying...\r\n");
      if(ESP_QueryIP() == ESP_OK)
      {
        ESP_Status_t* status = ESP_GetStatus();
        USART2_SendString("WiFi connected. IP: ");
        USART2_SendString(status->ip_address);
        USART2_SendString("\r\n");
      }
      else
      {
        USART2_SendString("Could not retrieve IP address\r\n");
      }
    }
    
    /* WiFi连接成功，配置MQTT */
    USART2_SendString("Configuring MQTT...\r\n");
    if(ESP_ConfigureMQTT(MQTT_CLIENT_ID, MQTT_USERNAME, MQTT_PASSWORD) == ESP_OK)
    {
      USART2_SendString("MQTT configured successfully\r\n");
      
      /* MQTT配置成功，连接到MQTT服务器 */
      USART2_SendString("Connecting to MQTT server...\r\n");
      if(ESP_ConnectMQTT(MQTT_SERVER, MQTT_PORT, MQTT_SSL) == ESP_OK)
      {
        USART2_SendString("MQTT connection successful!\r\n");
        
        /* 等待MQTT连接完全建立（重要！） */
        USART2_SendString("Waiting for MQTT connection to stabilize...\r\n");
        HAL_Delay(2000);  /* 等待2秒，让MQTT连接完全建立 */
        
        /* MQTT连接成功，订阅主题 */
        USART2_SendString("Subscribing to topic: ");
        USART2_SendString(MQTT_SUBSCRIBE_TOPIC);
        USART2_SendString("\r\n");
        if(ESP_SubscribeMQTT(MQTT_SUBSCRIBE_TOPIC) == ESP_OK)
        {
          USART2_SendString("MQTT subscription successful!\r\n");
          
          /* 订阅成功，发布消息 */
          USART2_SendString("Publishing message to topic: ");
          USART2_SendString(MQTT_PUBLISH_TOPIC);
          USART2_SendString("\r\n");
          if(ESP_PublishMQTT(MQTT_PUBLISH_TOPIC, MQTT_PUBLISH_MESSAGE) == ESP_OK)
          {
            USART2_SendString("MQTT message published successfully!\r\n");
          }
          else
          {
            USART2_SendString("MQTT message publish failed\r\n");
          }
        }
        else
        {
          USART2_SendString("MQTT subscription failed\r\n");
        }
      }
      else
      {
        USART2_SendString("MQTT connection failed\r\n");
      }
    }
    else
    {
      USART2_SendString("MQTT configuration failed\r\n");
    }
  }
  else
  {
    /* WiFi未连接，尝试自动连接 */
    if(ESP_ConnectWiFi(WIFI_SSID, WIFI_PASSWORD) == ESP_OK)
    {
      /* WiFi连接成功，获取IP地址 */
      ESP_Status_t* status = ESP_GetStatus();
      if(strlen(status->ip_address) > 0)
      {
        USART2_SendString("WiFi connected. IP: ");
        USART2_SendString(status->ip_address);
        USART2_SendString("\r\n");
      }
      else
      {
        /* 连接成功但没有IP地址，手动查询 */
        USART2_SendString("WiFi connected but no IP found, querying...\r\n");
        if(ESP_QueryIP() == ESP_OK)
        {
          ESP_Status_t* status = ESP_GetStatus();
          USART2_SendString("WiFi connected. IP: ");
          USART2_SendString(status->ip_address);
          USART2_SendString("\r\n");
        }
        else
        {
          USART2_SendString("Could not retrieve IP address\r\n");
        }
      }
      
      /* WiFi连接成功，配置MQTT */
      USART2_SendString("Configuring MQTT...\r\n");
      if(ESP_ConfigureMQTT(MQTT_CLIENT_ID, MQTT_USERNAME, MQTT_PASSWORD) == ESP_OK)
      {
        USART2_SendString("MQTT configured successfully\r\n");
        
        /* MQTT配置成功，连接到MQTT服务器 */
        USART2_SendString("Connecting to MQTT server...\r\n");
        if(ESP_ConnectMQTT(MQTT_SERVER, MQTT_PORT, MQTT_SSL) == ESP_OK)
        {
          USART2_SendString("MQTT connection successful!\r\n");
          
          /* 等待MQTT连接完全建立（重要！） */
          USART2_SendString("Waiting for MQTT connection to stabilize...\r\n");
          HAL_Delay(2000);  /* 等待2秒，让MQTT连接完全建立 */
          
          /* MQTT连接成功，订阅主题 */
          USART2_SendString("Subscribing to topic: ");
          USART2_SendString(MQTT_SUBSCRIBE_TOPIC);
          USART2_SendString("\r\n");
          if(ESP_SubscribeMQTT(MQTT_SUBSCRIBE_TOPIC) == ESP_OK)
          {
            USART2_SendString("MQTT subscription successful!\r\n");
            
            /* 订阅成功，发布消息 */
            USART2_SendString("Publishing message to topic: ");
            USART2_SendString(MQTT_PUBLISH_TOPIC);
            USART2_SendString("\r\n");
            if(ESP_PublishMQTT(MQTT_PUBLISH_TOPIC, MQTT_PUBLISH_MESSAGE) == ESP_OK)
            {
              USART2_SendString("MQTT message published successfully!\r\n");
            }
            else
            {
              USART2_SendString("MQTT message publish failed\r\n");
            }
          }
          else
          {
            USART2_SendString("MQTT subscription failed\r\n");
          }
        }
        else
        {
          USART2_SendString("MQTT connection failed\r\n");
        }
      }
      else
      {
        USART2_SendString("MQTT configuration failed\r\n");
      }
    }
    else
    {
      USART2_SendString("WiFi connection failed\r\n");
    }
  }
  
