luckyCharm1123/STM32_LED/Core/Src/main.c
  /* 保持ESP数据模式，持续接收MQTT消息 */
  /* 注意：esp_mode=1 表示所有USART2数据都会被当作ESP数据处理 */
  /* 如果需要接收用户命令，需要切换到esp_mode=0 */
  USART2_SendString("\r\n[INFO] System ready. Listening for MQTT messages...\r\n");
  USART2_SendString("[INFO] UART is in ESP data mode. All data from USART2 goes to ESP module.\r\n");
  DEBUG_SendString("\r\n[SYSTEM] Entering main loop - ESP mode active\r\n");
  DEBUG_SendString("[SYSTEM] Will continuously process MQTT messages\r\n\r\n");
  
  /* esp_mode保持为1，继续接收ESP数据（包括MQTT消息） */
  /* UART中断已经在运行中，无需重新启动 */
  
  /* USER CODE END 2 */

  /* Infinite loop */
  /* 无限循环 */
  /* USER CODE BEGIN WHILE */
  
  /* LED闪烁控制变量 - 使用非阻塞延时 */
  uint32_t led_last_toggle_time = HAL_GetTick();
  uint32_t led_toggle_interval = 500;  // LED翻转间隔（毫秒）
  
  /* SHT30传感器读取控制变量 */
  uint32_t sht30_last_read_time = HAL_GetTick();
  uint32_t sht30_read_interval = 10000;  // SHT30读取间隔（10秒）
  float sht30_temp, sht30_humi;
  
  /* 雨水传感器读取控制变量 */
  uint32_t rain_last_read_time = HAL_GetTick();
  uint32_t rain_read_interval = 10000;  // 雨水传感器读取间隔（10秒）
  
  DEBUG_SendString("[INFO] SHT30 reading interval: 10 seconds\r\n");
  DEBUG_SendString("[INFO] Rain sensor reading interval: 10 seconds (PA0/ADC1_CH0)\r\n");
  USART2_SendString("[INFO] SHT30 will output every 10 seconds\r\n");
  
  while (1)
  {
    /* USER CODE END WHILE */
    
    /* 处理ESP接收到的数据 - 高优先级，快速响应 */
    ESP_ProcessReceivedData();
    
    /* SHT30温湿度读取 - 每5秒读取一次（软件I2C） */
    if(HAL_GetTick() - sht30_last_read_time >= sht30_read_interval)
    {
      uint8_t ret = SHT30_Soft_Read(&sht30_temp, &sht30_humi);
      
      /* 转换为整数输出（避免浮点printf问题） */
      int temp_int = (int)sht30_temp;
      int temp_dec = (int)((sht30_temp - temp_int) * 100);
      int humi_int = (int)sht30_humi;
      int humi_dec = (int)((sht30_humi - humi_int) * 100);
      
      char temp_str[100];
      if(ret == 0)
      {
        /* CRC成功 */
        snprintf(temp_str, sizeof(temp_str), "[SHT30] Temp: %d.%02d°C, Humidity: %d.%02d%%\r\n", 
                 temp_int, temp_dec, humi_int, humi_dec);
        DEBUG_SendString(temp_str);  // 发送到调试串口USART1
        USART2_SendString(temp_str); // 发送到主串口USART2
        
        /* 发布到MQTT */
        char mqtt_payload[80];
        snprintf(mqtt_payload, sizeof(mqtt_payload), 
                 "{\"temp\":%d.%02d,\"humi\":%d.%02d}", 
                 temp_int, temp_dec, humi_int, humi_dec);
        ESP_PublishMQTT("sensor/sht30", mqtt_payload);
        DEBUG_SendString("[MQTT] Published SHT30 data\r\n");
      }
      
      sht30_last_read_time = HAL_GetTick();
    }
    
    /* 雨水传感器读取 - 每10秒读取一次（ADC） */
    if(HAL_GetTick() - rain_last_read_time >= rain_read_interval)
    {
      /* 启动ADC转换 */
      HAL_ADC_Start(&hadc1);
      
      /* 等待转换完成（超时1秒） */
      if(HAL_ADC_PollForConversion(&hadc1, 1000) == HAL_OK)
      {
        /* 读取ADC值（12位，0-4095） */
        uint32_t adc_value = HAL_ADC_GetValue(&hadc1);
        
        /* 计算电压值（假设参考电压3.3V） */
        float voltage = (adc_value * 3.3f) / 4095.0f;
        
        /* 计算干燥度（0-100%，值越大表示越干燥） */
        uint32_t dry_percent = (adc_value * 100) / 4095;
        
        /* 计算湿度（0-100%，值越大表示越潮湿/有水） */
        uint32_t wet_percent = 100 - dry_percent;
        
        /* 输出到调试串口和主串口 */
        char rain_str[120];
        snprintf(rain_str, sizeof(rain_str), 
                 "[RAIN] ADC=%lu, Voltage=%d.%02dV, Dry=%lu%%, Wet=%lu%%\r\n", 
                 adc_value, 
                 (int)voltage, (int)((voltage - (int)voltage) * 100),
                 dry_percent, wet_percent);
        DEBUG_SendString(rain_str);
        USART2_SendString(rain_str);
        
        /* 发布到MQTT */
        char mqtt_payload[100];
        snprintf(mqtt_payload, sizeof(mqtt_payload), 
                 "{\"adc\":%lu,\"voltage\":%d.%02d,\"dry\":%lu,\"wet\":%lu}", 
                 adc_value,
                 (int)voltage, (int)((voltage - (int)voltage) * 100),
                 dry_percent, wet_percent);
        ESP_PublishMQTT("sensor/rain", mqtt_payload);
        DEBUG_SendString("[MQTT] Published rain sensor data\r\n");
      }
      
      /* 停止ADC转换 */
      HAL_ADC_Stop(&hadc1);
      
      rain_last_read_time = HAL_GetTick();
    }
    
    /* LED闪烁逻辑 - 使用非阻塞延时，不影响ESP数据处理 */
    if(HAL_GetTick() - led_last_toggle_time >= led_toggle_interval)
    {
      HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);  // 翻转LED引脚电平（亮/灭切换）
      led_last_toggle_time = HAL_GetTick();        // 更新最后翻转时间
    }
    
    /* 短暂延时，避免CPU空转，但不阻塞ESP数据处理 */
    HAL_Delay(10);  // 10ms延时，确保ESP数据能及时处理
    
    /* USER CODE BEGIN 3 */
    /* 用户代码开始：第3区 */
    /* 可以在此处添加循环体内的自定义代码 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration 系统时钟配置
  * @details 配置STM32的系统时钟源和各总线时钟分频
  *          本配置使用内部高速时钟(HSI)作为系统时钟源
  *          HSI = 8MHz (内部RC振荡器)
  * @retval None 无返回值
  * @note 时钟树配置：
  *       HSI(8MHz) → SYSCLK(8MHz) → HCLK(8MHz)
  *       → PCLK1(8MHz) → APB1外设（包括USART2）
  *       → PCLK2(8MHz) → APB2外设
  * @note 时钟配置说明：
  *       - 不使用PLL，直接使用HSI作为系统时钟
  *       - 所有总线时钟都为8MHz
  *       - Flash等待周期为0（8MHz以下不需要等待）
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};  // 振荡器初始化结构体
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};  // 时钟初始化结构体

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  * 根据RCC_OscInitTypeDef结构体中的指定参数初始化RCC振荡器
  * 
  * 配置振荡器参数：
  * - 选择振荡器类型：内部高速时钟(HSI)
  * - 设置工作状态：开启
  * - 校准值：使用默认校准值
  * - PLL状态：不使用（关闭）
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;  // 振荡器类型：内部高速时钟(HSI)
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;                    // HSI状态：开启
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;  // HSI校准值：默认值
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;              // PLL状态：不使用（PLL关闭）
  
  /* 应用振荡器配置 */
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();  // 如果配置失败，调用错误处理函数
  }

  /** Initializes the CPU, AHB and APB buses clocks
  * 初始化CPU、AHB和APB总线时钟
  * 
  * 配置时钟树参数：
  * - 选择系统时钟源：HSI
  * - 设置各总线分频系数：都不分频
  * - 配置Flash等待周期：0（8MHz以下不需要等待）
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;  // 时钟类型：HCLK、SYSCLK、PCLK1、PCLK2
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;    // 系统时钟源：HSI
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;        // AHB时钟分频：不分频（HCLK = SYSCLK）
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;         // APB1时钟分频：不分频（PCLK1 = HCLK）
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;         // APB2时钟分频：不分频（PCLK2 = HCLK）

