luckyCharm1123/STM32_LED/Core/Src/main.c
  /** Configure Regular Channel */
  sConfig.Channel = ADC_CHANNEL_0;                      // 通道0（PA0）
  sConfig.Rank = ADC_REGULAR_RANK_1;                    // 转换顺序：第1个
  sConfig.SamplingTime = ADC_SAMPLETIME_55CYCLES_5;     // 采样时间：55.5周期
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN ADC1_Init 2 */
  /* USER CODE END ADC1_Init 2 */
}

/* USER CODE BEGIN 4 */
/* 用户代码开始：第4区 */
/* 可以在此处定义自定义函数 */

/**
  * @brief USART2中断回调函数
  * @param huart: UART句柄
  * @retval None
  * @details 当接收到一个字节数据时调用此函数
  *          这是HAL库的中断回调函数，需要在stm32f1xx_it.c中配置USART2_IRQHandler
  *          该中断服务函数会调用HAL_UART_IRQHandler，最终调用此回调函数
  * @note 接收流程：
  *       1. HAL_UART_Receive_IT启动接收
  *       2. 接收到数据后触发USART2_IRQHandler
  *       3. HAL_UART_IRQHandler处理中断并调用此回调函数
  *       4. 在回调函数中处理数据并准备下一次接收
  * @note 双模式接收机制：
  *       - 用户命令模式：接收用户输入的控制命令，以回车/换行结束
  *       - ESP数据模式：直接接收ESP模块的响应数据，以回车/换行结束
  *       - 通过esp_mode标志切换两种模式
  */
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
  // 检查是否是USART2的中断
  if(huart->Instance == USART2)
  {
      // ==================== ESP数据模式处理 ====================
      // 当esp_mode=1时，处于ESP模块数据接收状态
      // 此时直接将接收到的数据传递给ESP驱动层处理
      if(esp_mode)
      {
        // 更新最后接收时间戳（用于超时检测）
        esp_last_rx_time = HAL_GetTick();
        
      // 检查是否收到换行符或回车符，表示ESP模块的一行响应结束
      if(rx_buffer[0] == '\r' || rx_buffer[0] == '\n')
      {
        // 确保缓冲区中有数据（不是连续的换行符）
        if(esp_rx_index > 0)
        {
          // 添加字符串结束符，使ESP驱动层能正确解析响应
          esp_rx_buffer[esp_rx_index] = '\0';
          // 设置ESP接收完成标志
          esp_rx_complete = 1;
          // 设置响应就绪标志，让等待函数能够立即处理
          esp_response_ready = 1;
          
          // 注意：不在中断中重置esp_rx_index，避免新数据覆盖未处理的旧数据
          // esp_rx_index将在ESP_ProcessReceivedData()处理完数据后重置
        }
        // 如果esp_rx_index==0，说明是连续的换行符，直接忽略，不存储
      }
      else
      {
        // 不是换行符，存储到缓冲区
        if(esp_rx_index < ESP_RX_BUFFER_SIZE - 1)
        {
          esp_rx_buffer[esp_rx_index] = rx_buffer[0];
          esp_rx_index++;
        }
        else
        {
          // ESP缓冲区满，重置索引，避免溢出
          esp_rx_index = 0;
        }
      }
        
        // 继续接收下一个字节（ESP模式）
        HAL_UART_Receive_IT(&huart2, &rx_buffer[0], 1);
      }
    // ==================== 用户命令模式处理 ====================
    // 当esp_mode=0时，处于用户命令接收状态
    // 此时接收用户通过串口输入的控制命令
    else
    {
      // 检查是否收到换行符或回车符，表示用户命令结束
      if(rx_buffer[rx_index] == '\r' || rx_buffer[rx_index] == '\n')
      {
        // 只有当缓冲区有数据时才处理
        if(rx_index > 0)
        {
          // 添加字符串结束符，使字符串处理函数能正确解析命令
          rx_buffer[rx_index] = '\0';
          // 设置接收完成标志，主循环中的Process_Received_Data()会处理这个命令
          rx_complete = 1;
          // 注意：不在此处重启接收，由Process_Received_Data()处理完后重启
          // 这样可以确保命令处理完成后再准备接收下一个命令
        }
        else
        {
          // 收到空行（只有回车/换行），直接丢弃，继续接收下一个字节
          HAL_UART_Receive_IT(&huart2, &rx_buffer[rx_index], 1);
        }
      }
      // 检查缓冲区是否还有空间继续接收
      else if(rx_index < RX_BUFFER_SIZE - 1)
      {
        // 索引递增，准备接收下一个字符
        rx_index++;
        // 继续接收下一个字节
        HAL_UART_Receive_IT(&huart2, &rx_buffer[rx_index], 1);
      }
      else
      {
        // 缓冲区满，重置索引，避免溢出
        // 这种情况下丢弃之前的数据，重新开始接收
        rx_index = 0;
        HAL_UART_Receive_IT(&huart2, &rx_buffer[rx_index], 1);
      }
    }
  }
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence. 此函数在发生错误时执行
  * @details 当程序遇到严重错误时调用此函数
  *          典型错误场景：
  *          - 时钟配置失败
  *          - 外设初始化失败
  *          - 硬件故障
  *          - 软件异常
  * @retval None 无返回值
  * @note 此函数不会返回，程序在此处阻塞
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* 用户代码开始：错误处理调试 */
  
  /* 标准错误处理实现 */
  __disable_irq();  // 禁用所有中断
  /* 
   * __disable_irq()说明：
   * - 关闭全局中断使能
   * - 防止在错误状态下执行中断服务程序
   * - 提高系统安全性
   */
  
  /* 可以添加错误指示：快速闪烁LED */
  while (1)
  {
    HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);  // 快速翻转LED
    HAL_Delay(100);  // 快速闪烁表示错误（100ms周期）
    /* 
     * 死循环说明：
     * - 程序在此处阻塞，无法继续执行
     * - 可以通过调试器查看程序状态
     * - LED快速闪烁提供视觉错误指示
     * - 便于现场调试和故障诊断
     */
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  *         报告发生assert_param错误的源文件名和源行号
  * @details 这是断言失败时的回调函数
  *          用于调试和开发阶段检测参数错误
  *          当HAL库中的assert_param宏检测到无效参数时调用此函数
  * @param  file: pointer to the source file name 源文件名指针
  * @param  line: assert_param error line source number 断言参数错误的行号
  * @retval None 无返回值
  * @note 此函数仅在调试版本中有效（定义了USE_FULL_ASSERT宏）
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* 用户代码开始：第6区 */
  /* 可以在此处添加断言失败的处理代码 */
  /* 典型实现：
   * printf("Assert failed: %s, line %lu\n", file, line);
   * 或者通过串口发送错误信息
   * 或者在调试器中设置断点
   */
  
  /* 无限循环，便于调试时定位问题 */
  while (1)
  {
  }
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
